Zh-Commander/CommentTranslator/temp/code_split_output/Inc/stm32f1xx_hal_tim.part5.h
/* 获取互补通道状态宏定义：返回指定互补通道的当前状态 */
#define TIM_CHANNEL_N_STATE_GET(__HANDLE__, __CHANNEL__)\
  (((__CHANNEL__) == TIM_CHANNEL_1) ? (__HANDLE__)->ChannelNState[0] :\
   ((__CHANNEL__) == TIM_CHANNEL_2) ? (__HANDLE__)->ChannelNState[1] :\
   ((__CHANNEL__) == TIM_CHANNEL_3) ? (__HANDLE__)->ChannelNState[2] :\
   (__HANDLE__)->ChannelNState[3])

/* 设置互补通道状态宏定义：设置指定互补通道的状态 */
#define TIM_CHANNEL_N_STATE_SET(__HANDLE__, __CHANNEL__, __CHANNEL_STATE__) \
  (((__CHANNEL__) == TIM_CHANNEL_1) ? ((__HANDLE__)->ChannelNState[0] = (__CHANNEL_STATE__)) :\
   ((__CHANNEL__) == TIM_CHANNEL_2) ? ((__HANDLE__)->ChannelNState[1] = (__CHANNEL_STATE__)) :\
   ((__CHANNEL__) == TIM_CHANNEL_3) ? ((__HANDLE__)->ChannelNState[2] = (__CHANNEL_STATE__)) :\
   ((__HANDLE__)->ChannelNState[3] = (__CHANNEL_STATE__)))

/* 设置所有互补通道状态宏定义：统一设置所有4个互补通道的状态 */
#define TIM_CHANNEL_N_STATE_SET_ALL(__HANDLE__,  __CHANNEL_STATE__) do { \
                                                                         (__HANDLE__)->ChannelNState[0] = \
                                                                         (__CHANNEL_STATE__);  \
                                                                         (__HANDLE__)->ChannelNState[1] = \
                                                                         (__CHANNEL_STATE__);  \
                                                                         (__HANDLE__)->ChannelNState[2] = \
                                                                         (__CHANNEL_STATE__);  \
                                                                         (__HANDLE__)->ChannelNState[3] = \
                                                                         (__CHANNEL_STATE__);  \
                                                                       } while(0)

/**
  * @}
  */
/* 私有宏定义结束 -----------------------------------------------------*/

/* 包含 TIM HAL 扩展模块 */
#include "stm32f1xx_hal_tim_ex.h"

/* 导出函数 --------------------------------------------------------*/
/** @addtogroup TIM_Exported_Functions TIM 导出函数
  * @{
  */

/** @addtogroup TIM_Exported_Functions_Group1 TIM 时基功能函数
  *  @brief   时基功能函数
  * @{
  */
/* 时基功能函数 ********************************************************/
HAL_StatusTypeDef HAL_TIM_Base_Init(TIM_HandleTypeDef *htim); // 初始化定时器时基单元
HAL_StatusTypeDef HAL_TIM_Base_DeInit(TIM_HandleTypeDef *htim); // 反初始化定时器时基单元
void HAL_TIM_Base_MspInit(TIM_HandleTypeDef *htim); // 初始化底层硬件(MSP)，如时钟使能、GPIO配置
void HAL_TIM_Base_MspDeInit(TIM_HandleTypeDef *htim); // 反初始化底层硬件(MSP)
/* 阻塞模式：轮询 */
HAL_StatusTypeDef HAL_TIM_Base_Start(TIM_HandleTypeDef *htim); // 启动定时器(阻塞模式)
HAL_StatusTypeDef HAL_TIM_Base_Stop(TIM_HandleTypeDef *htim); // 停止定时器(阻塞模式)
/* 非阻塞模式：中断 */
HAL_StatusTypeDef HAL_TIM_Base_Start_IT(TIM_HandleTypeDef *htim); // 启动定时器(中断模式)
HAL_StatusTypeDef HAL_TIM_Base_Stop_IT(TIM_HandleTypeDef *htim); // 停止定时器(中断模式)
/* 非阻塞模式：DMA */
HAL_StatusTypeDef HAL_TIM_Base_Start_DMA(TIM_HandleTypeDef *htim, const uint32_t *pData, uint16_t Length); // 启动定时器(DMA模式)
HAL_StatusTypeDef HAL_TIM_Base_Stop_DMA(TIM_HandleTypeDef *htim); // 停止定时器(DMA模式)
/**
  * @}
  */

/** @addtogroup TIM_Exported_Functions_Group2 TIM 输出比较功能函数
  *  @brief   TIM 输出比较功能函数
  * @{
  */
/* 定时器输出比较功能函数 *********************************************/
HAL_StatusTypeDef HAL_TIM_OC_Init(TIM_HandleTypeDef *htim); // 初始化输出比较模式
HAL_StatusTypeDef HAL_TIM_OC_DeInit(TIM_HandleTypeDef *htim); // 反初始化输出比较模式
void HAL_TIM_OC_MspInit(TIM_HandleTypeDef *htim); // 初始化底层硬件(MSP)
void HAL_TIM_OC_MspDeInit(TIM_HandleTypeDef *htim); // 反初始化底层硬件(MSP)
/* 阻塞模式：轮询 */
HAL_StatusTypeDef HAL_TIM_OC_Start(TIM_HandleTypeDef *htim, uint32_t Channel); // 启动输出比较(阻塞模式)
HAL_StatusTypeDef HAL_TIM_OC_Stop(TIM_HandleTypeDef *htim, uint32_t Channel); // 停止输出比较(阻塞模式)
/* 非阻塞模式：中断 */
HAL_StatusTypeDef HAL_TIM_OC_Start_IT(TIM_HandleTypeDef *htim, uint32_t Channel); // 启动输出比较(中断模式)
HAL_StatusTypeDef HAL_TIM_OC_Stop_IT(TIM_HandleTypeDef *htim, uint32_t Channel); // 停止输出比较(中断模式)
/* 非阻塞模式：DMA */
HAL_StatusTypeDef HAL_TIM_OC_Start_DMA(TIM_HandleTypeDef *htim, uint32_t Channel, const uint32_t *pData,
                                       uint16_t Length); // 启动输出比较(DMA模式)
HAL_StatusTypeDef HAL_TIM_OC_Stop_DMA(TIM_HandleTypeDef *htim, uint32_t Channel); // 停止输出比较(DMA模式)
/**
  * @}
  */

/** @addtogroup TIM_Exported_Functions_Group3 TIM PWM功能函数
  *  @brief   TIM PWM功能函数
  * @{
  */
/* 定时器PWM功能函数 ********************************************************/
HAL_StatusTypeDef HAL_TIM_PWM_Init(TIM_HandleTypeDef *htim); // 初始化PWM模式
HAL_StatusTypeDef HAL_TIM_PWM_DeInit(TIM_HandleTypeDef *htim); // 反初始化PWM模式
void HAL_TIM_PWM_MspInit(TIM_HandleTypeDef *htim); // 初始化底层硬件(MSP)
void HAL_TIM_PWM_MspDeInit(TIM_HandleTypeDef *htim); // 反初始化底层硬件(MSP)
/* 阻塞模式：轮询 */
HAL_StatusTypeDef HAL_TIM_PWM_Start(TIM_HandleTypeDef *htim, uint32_t Channel); // 启动PWM输出(阻塞模式)
HAL_StatusTypeDef HAL_TIM_PWM_Stop(TIM_HandleTypeDef *htim, uint32_t Channel); // 停止PWM输出(阻塞模式)
/* 非阻塞模式：中断 */
HAL_StatusTypeDef HAL_TIM_PWM_Start_IT(TIM_HandleTypeDef *htim, uint32_t Channel); // 启动PWM输出(中断模式)
HAL_StatusTypeDef HAL_TIM_PWM_Stop_IT(TIM_HandleTypeDef *htim, uint32_t Channel); // 停止PWM输出(中断模式)
/* 非阻塞模式：DMA */
HAL_StatusTypeDef HAL_TIM_PWM_Start_DMA(TIM_HandleTypeDef *htim, uint32_t Channel, const uint32_t *pData,
                                        uint16_t Length); // 启动PWM输出(DMA模式)
HAL_StatusTypeDef HAL_TIM_PWM_Stop_DMA(TIM_HandleTypeDef *htim, uint32_t Channel); // 停止PWM输出(DMA模式)
/**
  * @}
  */

/** @addtogroup TIM_Exported_Functions_Group4 TIM 输入捕获功能函数
  *  @brief   TIM 输入捕获功能函数
  * @{
  */
/* 定时器输入捕获功能函数 **********************************************/
HAL_StatusTypeDef HAL_TIM_IC_Init(TIM_HandleTypeDef *htim); // 初始化输入捕获模式
HAL_StatusTypeDef HAL_TIM_IC_DeInit(TIM_HandleTypeDef *htim); // 反初始化输入捕获模式
void HAL_TIM_IC_MspInit(TIM_HandleTypeDef *htim); // 初始化底层硬件(MSP)
void HAL_TIM_IC_MspDeInit(TIM_HandleTypeDef *htim); // 反初始化底层硬件(MSP)
/* 阻塞模式：轮询 */
HAL_StatusTypeDef HAL_TIM_IC_Start(TIM_HandleTypeDef *htim, uint32_t Channel); // 启动输入捕获(阻塞模式)
HAL_StatusTypeDef HAL_TIM_IC_Stop(TIM_HandleTypeDef *htim, uint32_t Channel); // 停止输入捕获(阻塞模式)
/* 非阻塞模式：中断 */
HAL_StatusTypeDef HAL_TIM_IC_Start_IT(TIM_HandleTypeDef *htim, uint32_t Channel); // 启动输入捕获(中断模式)
HAL_StatusTypeDef HAL_TIM_IC_Stop_IT(TIM_HandleTypeDef *htim, uint32_t Channel); // 停止输入捕获(中断模式)
/* 非阻塞模式：DMA */
HAL_StatusTypeDef HAL_TIM_IC_Start_DMA(TIM_HandleTypeDef *htim, uint32_t Channel, uint32_t *pData, uint16_t Length); // 启动输入捕获(DMA模式)
HAL_StatusTypeDef HAL_TIM_IC_Stop_DMA(TIM_HandleTypeDef *htim, uint32_t Channel); // 停止输入捕获(DMA模式)
/**
  * @}
  */

/** @addtogroup TIM_Exported_Functions_Group5 TIM 单脉冲功能函数
  *  @brief   TIM 单脉冲功能函数
  * @{
  */
/* 定时器单脉冲功能函数 **************************************************/
HAL_StatusTypeDef HAL_TIM_OnePulse_Init(TIM_HandleTypeDef *htim, uint32_t OnePulseMode); // 初始化单脉冲模式
HAL_StatusTypeDef HAL_TIM_OnePulse_DeInit(TIM_HandleTypeDef *htim); // 反初始化单脉冲模式
void HAL_TIM_OnePulse_MspInit(TIM_HandleTypeDef *htim); // 初始化底层硬件(MSP)
void HAL_TIM_OnePulse_MspDeInit(TIM_HandleTypeDef *htim); // 反初始化底层硬件(MSP)
/* 阻塞模式：轮询 */
HAL_StatusTypeDef HAL_TIM_OnePulse_Start(TIM_HandleTypeDef *htim, uint32_t OutputChannel); // 启动单脉冲输出(阻塞模式)
HAL_StatusTypeDef HAL_TIM_OnePulse_Stop(TIM_HandleTypeDef *htim, uint32_t OutputChannel); // 停止单脉冲输出(阻塞模式)
/* 非阻塞模式：中断 */
HAL_StatusTypeDef HAL_TIM_OnePulse_Start_IT(TIM_HandleTypeDef *htim, uint32_t OutputChannel); // 启动单脉冲输出(中断模式)
HAL_StatusTypeDef HAL_TIM_OnePulse_Stop_IT(TIM_HandleTypeDef *htim, uint32_t OutputChannel); // 停止单脉冲输出(中断模式)
/**
  * @}
  */

/** @addtogroup TIM_Exported_Functions_Group6 TIM 编码器功能函数
  *  @brief   TIM 编码器功能函数
  * @{
  */
/* 定时器编码器功能函数 ****************************************************/
HAL_StatusTypeDef HAL_TIM_Encoder_Init(TIM_HandleTypeDef *htim, const TIM_Encoder_InitTypeDef *sConfig); // 初始化编码器模式
HAL_StatusTypeDef HAL_TIM_Encoder_DeInit(TIM_HandleTypeDef *htim); // 反初始化编码器模式
void HAL_TIM_Encoder_MspInit(TIM_HandleTypeDef *htim); // 初始化底层硬件(MSP)
void HAL_TIM_Encoder_MspDeInit(TIM_HandleTypeDef *htim); // 反初始化底层硬件(MSP)
/* 阻塞模式：轮询 */
HAL_StatusTypeDef HAL_TIM_Encoder_Start(TIM_HandleTypeDef *htim, uint32_t Channel); // 启动编码器接口(阻塞模式)
HAL_StatusTypeDef HAL_TIM_Encoder_Stop(TIM_HandleTypeDef *htim, uint32_t Channel); // 停止编码器接口(阻塞模式)
/* 非阻塞模式：中断 */
HAL_StatusTypeDef HAL_TIM_Encoder_Start_IT(TIM_HandleTypeDef *htim, uint32_t Channel); // 启动编码器接口(中断模式)
HAL_StatusTypeDef HAL_TIM_Encoder_Stop_IT(TIM_HandleTypeDef *htim, uint32_t Channel); // 停止编码器接口(中断模式)
/* 非阻塞模式：DMA */
HAL_StatusTypeDef HAL_TIM_Encoder_Start_DMA(TIM_HandleTypeDef *htim, uint32_t Channel, uint32_t *pData1,
                                            uint32_t *pData2, uint16_t Length); // 启动编码器接口(DMA模式)
HAL_StatusTypeDef HAL_TIM_Encoder_Stop_DMA(TIM_HandleTypeDef *htim, uint32_t Channel); // 停止编码器接口(DMA模式)
/**
  * @}
  */

